
public class ReadMy
{
    //Прошу обратить Ваше внимание!
    //Тестовое задание выполнял в свободное время от работы.
    //Примерно по 2 часа кадый день. На всю работу ущло 10 часов.
    //Всё выполненоно в рамках задания, без переусложнения для экономии времени.
    //При получении более конкретного задания може расширить или добавить архитектурные решения.

    //Для управления машиной согласно задания используется уже вложенный контроллер
    //Для удобства доработан скрипт ResetVehicle
}
